{
    "1": {
        "authors": null,
        "changes": [],
        "comments": "",
        "date_init": "2023-07-12",
        "description": "\nEl objetivo principal del sistema de Venta de Espartos a desarrollar es crear una plataforma digital en forma de página web para la comercialización y venta de los variados productos de espartos que fabrica el artesano Antonio López. Se trata de una solución moderna y efectiva que permitirá a los clientes personalizar sus pedidos a su gusto, ya sea en el tamaño de las persianas, las dimensiones de las cabezas de toro o la apariencia de los bolsos, entre otros. De esta manera, se podrán satisfacer las necesidades específicas de cada cliente, incrementando así la satisfacción del cliente y aumentando su fidelidad a la empresa. Este sistema será un impulso para el negocio de Antonio López, ya que simplificará la forma en que se gestionan los pedidos y se adaptarán a las necesidades de cada cliente. Asimismo, permitirá la exposición de sus productos a un público mucho más amplio, permitiendo que más personas se familiaricen con su trabajo, aumentando así la visibilidad y la reputación de su empresa en el mercado. \n\nLa presencia en internet es crucial en el mundo de los negocios moderno, y lamentablemente, nuestro cliente ha estado fuera del radar durante demasiado tiempo. Sin una página web o un medio de contacto efectivo, su alcance se ha limitado a aquellos que ya lo conocen. Pero esto no tiene por qué seguir siendo así, y es por eso que hemos asumido la tarea de desarrollar una página web para nuestro cliente, con el objetivo de darle a su negocio la visibilidad que merece. \n\nDespués de la realización de este proyecto se podrán ofrecer servicios a un público mucho más amplio y diverso, y establecer su presencia en internet para llegar a nuevas audiencias y clientes potenciales. A través de la personalización de los pedidos, su negocio podrá destacar en un mercado cada vez más competitivo y responder a las necesidades específicas de cada cliente. Además, la página web le permitirá establecer una relación más cercana con sus clientes y recibir feedback, lo que puede ser una gran ayuda para mejorar y crecer en el futuro. \n\nEn el resto del documento describiremos en profundidad los requisitos necesarios para llevar a cabo el prototipo, los objetivos del sistema y todo lo necesario para llevar a cabo este proyecto. \n\n",
        "id": {
            "id": 1,
            "prefix": "TX"
        },
        "name": "Introduccion",
        "tracesFrom": null,
        "tracesTo": null,
        "versionMajor": "0",
        "versionMinor": "0"
    },
    "2": {
        "authors": null,
        "changes": [],
        "comments": "",
        "date_init": "2023-07-12",
        "description": "El negocio del esparto al que nos referimos está solo llevado por Antonio López, un hombre que trabaja solo y no está del todo acostumbrado a las nuevas tecnologías. Esto hace que su sistema de venta de productos de espartos se limite solo a la comunicación por WhatsApp o llamada, haciendo que sea más lenta la venta. Es decir, el cliente contacta con Antonio López, éste hace un boceto del pedido, lo manda, espera confirmación, y si todo está bien se procede a la venta. Si son necesarios cambios este proceso se retrasa más de lo necesario. \n\nNos encontramos también con el problema de que todos los datos se guardan a papel, o en los contactos de Antonio López, lo que acaba siendo muy confuso también para él. Hay que buscar manualmente a todos los contactos en caso de haber algún problema. Si pasase cualquier cosa con el móvil de Antonio López todos los clientes estarían perdidos. ",
        "id": {
            "id": 2,
            "prefix": "TX"
        },
        "name": "Descripcion",
        "tracesFrom": null,
        "tracesTo": null,
        "versionMajor": "0",
        "versionMinor": "0"
    }
}
